output/posts/slepc/index.org
#+BEGIN_COMMENT
.. title: SLEPc
.. slug: slepc
.. date: 2021-07-03 13:08:47 UTC+08:00
.. tags: C, petsc, MPI, parallel, eigenvalue
.. category: library
.. link: 
.. description: 
.. type: text

#+END_COMMENT

* SLEPc: PETSc 的本征值求解器扩展

  [[https://slepc.upv.es/][SLEPc]] 是用来求 PETSc 矩阵的扩展库。

** 基本结构

   SLEPc 有以下基本部分构成
   1. EPS (Eigenvalue Problem Solver)
   2. SVD (Singular Value Decomposition)
   3. PEP (Polynomial Eigenvalue Problem)
   4. NEP (Nonlinear Eigenvalue Problem)
   5. MFN (Matrix Function)

   还有一些辅助模块
   1. ST (Spectral Transformation)
   2. BV (Basis Vectors)
   3. DS (Dense System)
   4. RG (Region)
   5. FN (Mathematical Function)

** 安装

   下载时注意，SLEPc 的版本必须和 PETSc 版本一样

   编译选项

   #+begin_src bash
./configure --download-arpack --download-blopex --download-hpddm --download-primme  --with-slepc4py=1
   #+end_src 

   最后别忘了把环境变量 ~SLEPC_DIR~ 加上

** 基本使用

   程序开始和结束时分别调用 ~SlepcInitialize()~ 和 ~SlepcFinalize()~, 实际上就是 ~PetscInitialize()~ 和 ~PetscFinalize()~

   矩阵的使用跟 ~PETSc~ 完全一致

** EPS: 矩阵本征值求解器

