posts/slepc/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>SLEPc | chimez's blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/ipython.min.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/nikola_ipython.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../../rss.xml">
<link rel="canonical" href="https://chimez.github.io/posts/slepc/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="chimez">
<link rel="prev" href="../pthread/" title="pthread" type="text/html">
<link rel="next" href="../mpi/" title="MPI" type="text/html">
<meta property="og:site_name" content="chimez's blog">
<meta property="og:title" content="SLEPc">
<meta property="og:url" content="https://chimez.github.io/posts/slepc/">
<meta property="og:description" content="SLEPc: PETSc 的本征值求解器扩展


SLEPc 是用来求 PETSc 矩阵的扩展库。




基本结构


SLEPc 有以下基本部分构成


EPS (Eigenvalue Problem Solver)
SVD (Singular Value Decomposition)
PEP (Polynomial Eigenvalue Problem)
NEP (Nonlinear Eig">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2021-07-03T13:08:47+08:00">
<meta property="article:tag" content="C">
<meta property="article:tag" content="eigenvalue">
<meta property="article:tag" content="MPI">
<meta property="article:tag" content="parallel">
<meta property="article:tag" content="petsc">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="../../">

            <span id="blog-title">chimez's blog</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="../../archive.html" class="nav-link">Archive</a>
                </li>
<li class="nav-item">
<a href="../../categories/" class="nav-link">Tags</a>
                </li>
<li class="nav-item">
<a href="../../rss.xml" class="nav-link">RSS feed</a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">SLEPc</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    chimez
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2021-07-03T13:08:47+08:00" itemprop="datePublished" title="2021-07-03 13:08">2021-07-03 13:08</time></a>
            </p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-orgd0c31b3" class="outline-2">
<h2 id="orgd0c31b3">SLEPc: PETSc 的本征值求解器扩展</h2>
<div class="outline-text-2" id="text-orgd0c31b3">
<p>
<a href="https://slepc.upv.es/">SLEPc</a> 是用来求 PETSc 矩阵的扩展库。
</p>
</div>

<div id="outline-container-orge46353f" class="outline-3">
<h3 id="orge46353f">基本结构</h3>
<div class="outline-text-3" id="text-orge46353f">
<p>
SLEPc 有以下基本部分构成
</p>
<ol class="org-ol">
<li>EPS (Eigenvalue Problem Solver)</li>
<li>SVD (Singular Value Decomposition)</li>
<li>PEP (Polynomial Eigenvalue Problem)</li>
<li>NEP (Nonlinear Eigenvalue Problem)</li>
<li>MFN (Matrix Function)</li>
</ol>
<p>
还有一些辅助模块
</p>
<ol class="org-ol">
<li>ST (Spectral Transformation)</li>
<li>BV (Basis Vectors)</li>
<li>DS (Dense System)</li>
<li>RG (Region)</li>
<li>FN (Mathematical Function)</li>
</ol>
</div>
</div>

<div id="outline-container-org2603693" class="outline-3">
<h3 id="org2603693">安装</h3>
<div class="outline-text-3" id="text-org2603693">
<p>
下载时注意，SLEPc 的版本必须和 PETSc 版本一样
</p>

<p>
编译选项
</p>

<div class="highlight"><pre><span></span>   ./configure --download-arpack --download-blopex --download-hpddm --download-primme  --with-slepc4py=1
</pre></div>

<p>
最后别忘了把环境变量 <code>SLEPC_DIR</code> 加上
</p>
</div>
</div>

<div id="outline-container-org3b23ca2" class="outline-3">
<h3 id="org3b23ca2">基本使用</h3>
<div class="outline-text-3" id="text-org3b23ca2">
<p>
程序开始和结束时分别调用 <code>SlepcInitialize()</code> 和 <code>SlepcFinalize()</code>, 实际上就是 <code>PetscInitialize()</code> 和 <code>PetscFinalize()</code>
</p>

<p>
矩阵的使用跟 <code>PETSc</code> 完全一致
</p>
</div>
</div>
