posts/slepc/index.html

<div id="outline-container-orgd2fc057" class="outline-3">
<h3 id="orgd2fc057">EPS: 矩阵本征值求解器</h3>
<div class="outline-text-3" id="text-orgd2fc057">
</div>
<div id="outline-container-orgd499dc8" class="outline-4">
<h4 id="orgd499dc8">基本使用</h4>
<div class="outline-text-4" id="text-orgd499dc8">
<ol class="org-ol">
<li>
<code>EPSCreate(MPI_Comm comm,EPS *eps);</code> 
<ol class="org-ol">
<li>创建求解器</li>
</ol>
</li>
<li>
<code>EPSSetOperators(EPS eps,Mat A,Mat B);</code>
<ol class="org-ol">
<li>设置要解的算符</li>
</ol>
</li>
<li>
<code>EPSSetFromOptions(EPS eps);</code>
<ol class="org-ol">
<li>添加运行时设置</li>
</ol>
</li>
<li>
<code>EPSSolve(EPS eps);</code>
<ol class="org-ol">
<li>运行求解器</li>
</ol>
</li>
<li>
<code>EPSDestroy(EPS *eps);</code>
<ol class="org-ol">
<li>销毁求解器</li>
</ol>
</li>
<li>
<code>EPSSetUp(EPS eps);</code>
<ol class="org-ol">
<li>某些更具体的设置, 如果有需要的话，要在运行求解器之前设置</li>
</ol>
</li>
<li>
<code>EPSGetST(EPS eps,ST *st);</code>
<ol class="org-ol">
<li>获得谱变换器(ST), EPS 会默认自动创建一个 ST 对象，如果需要设置谱变换，就要这样获得它</li>
</ol>
</li>
<li>
<code>EPSView(EPS eps,PetscViewer viewer);</code>
<ol class="org-ol">
<li>打印求解器配置</li>
</ol>
</li>
</ol>
<div class="highlight"><pre><span></span><span class="w">    </span><span class="cp">#include</span><span class="w"> </span><span class="cpf">&lt;slepceps.h&gt;</span><span class="cp"></span>


<span class="w">    </span><span class="n">Mat</span><span class="w"> </span><span class="n">A</span><span class="p">;</span><span class="w"> </span><span class="cm">/* problem matrix */</span><span class="w"></span>
<span class="w">    </span><span class="cm">/* do something to fill A */</span><span class="w"></span>

<span class="w">    </span><span class="n">PetscErrorCode</span><span class="w"> </span><span class="n">ierr</span><span class="p">;</span><span class="w"></span>
<span class="w">    </span><span class="cm">/* Create eigensolver context */</span><span class="w"></span>
<span class="w">    </span><span class="n">EPS</span><span class="w"> </span><span class="n">eps</span><span class="p">;</span><span class="w"> </span><span class="cm">/* eigenproblem solver context */</span><span class="w"></span>
<span class="w">    </span><span class="n">ierr</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">EPSCreate</span><span class="p">(</span><span class="n">PETSC_COMM_WORLD</span><span class="p">,</span><span class="w"> </span><span class="o">&amp;</span><span class="n">eps</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">CHKERRQ</span><span class="p">(</span><span class="n">ierr</span><span class="p">);</span><span class="w"></span>

<span class="w">    </span><span class="cm">/* Set operators. In this case, it is a standard eigenvalue problem */</span><span class="w"></span>
<span class="w">    </span><span class="n">ierr</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">EPSSetOperators</span><span class="p">(</span><span class="n">eps</span><span class="p">,</span><span class="w"> </span><span class="n">A</span><span class="p">,</span><span class="w"> </span><span class="nb">NULL</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">CHKERRQ</span><span class="p">(</span><span class="n">ierr</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">ierr</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">EPSSetProblemType</span><span class="p">(</span><span class="n">eps</span><span class="p">,</span><span class="w"> </span><span class="n">EPS_HEP</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">CHKERRQ</span><span class="p">(</span><span class="n">ierr</span><span class="p">);</span><span class="w"></span>

<span class="w">    </span><span class="cm">/* show EPS setup */</span><span class="w"></span>
<span class="w">    </span><span class="n">ierr</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">EPSView</span><span class="p">(</span><span class="n">eps</span><span class="p">,</span><span class="w"> </span><span class="n">PETSC_VIEWER_STDOUT_WORLD</span><span class="p">)</span><span class="w"> </span><span class="p">;</span><span class="w"></span>
<span class="w">    </span><span class="n">CHKERRQ</span><span class="p">(</span><span class="n">ierr</span><span class="p">);</span><span class="w"></span>

<span class="w">    </span><span class="cm">/* Set solver parameters at runtime */</span><span class="w"></span>
<span class="w">    </span><span class="n">ierr</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">EPSSetFromOptions</span><span class="p">(</span><span class="n">eps</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">CHKERRQ</span><span class="p">(</span><span class="n">ierr</span><span class="p">);</span><span class="w"></span>

<span class="w">    </span><span class="cm">/* Solve the eigensystem */</span><span class="w"></span>
<span class="w">    </span><span class="n">ierr</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">EPSSolve</span><span class="p">(</span><span class="n">eps</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">CHKERRQ</span><span class="p">(</span><span class="n">ierr</span><span class="p">);</span><span class="w"></span>

<span class="w">    </span><span class="cm">/* Optional: Get some information from the solver and display it */</span><span class="w"></span>
<span class="w">    </span><span class="n">PetscInt</span><span class="w"> </span><span class="n">its</span><span class="p">;</span><span class="w"></span>
<span class="w">    </span><span class="n">ierr</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">EPSGetIterationNumber</span><span class="p">(</span><span class="n">eps</span><span class="p">,</span><span class="w"> </span><span class="o">&amp;</span><span class="n">its</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">CHKERRQ</span><span class="p">(</span><span class="n">ierr</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">ierr</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">PetscPrintf</span><span class="p">(</span><span class="n">PETSC_COMM_WORLD</span><span class="p">,</span><span class="w"> </span><span class="s">" Number of iterations of the method: %D</span><span class="se">\n</span><span class="s">"</span><span class="p">,</span><span class="w"> </span><span class="n">its</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">CHKERRQ</span><span class="p">(</span><span class="n">ierr</span><span class="p">);</span><span class="w"></span>

<span class="w">    </span><span class="n">EPSType</span><span class="w"> </span><span class="n">type</span><span class="p">;</span><span class="w"></span>
<span class="w">    </span><span class="n">ierr</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">EPSGetType</span><span class="p">(</span><span class="n">eps</span><span class="p">,</span><span class="w"> </span><span class="o">&amp;</span><span class="n">type</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">CHKERRQ</span><span class="p">(</span><span class="n">ierr</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">ierr</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">PetscPrintf</span><span class="p">(</span><span class="n">PETSC_COMM_WORLD</span><span class="p">,</span><span class="w"> </span><span class="s">" Solution method: %s</span><span class="se">\n\n</span><span class="s">"</span><span class="p">,</span><span class="w"> </span><span class="n">type</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">CHKERRQ</span><span class="p">(</span><span class="n">ierr</span><span class="p">);</span><span class="w"></span>

<span class="w">    </span><span class="n">PetscInt</span><span class="w"> </span><span class="n">nev</span><span class="p">;</span><span class="w"></span>
<span class="w">    </span><span class="n">ierr</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">EPSGetDimensions</span><span class="p">(</span><span class="n">eps</span><span class="p">,</span><span class="w"> </span><span class="o">&amp;</span><span class="n">nev</span><span class="p">,</span><span class="w"> </span><span class="nb">NULL</span><span class="p">,</span><span class="w"> </span><span class="nb">NULL</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">CHKERRQ</span><span class="p">(</span><span class="n">ierr</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">ierr</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">PetscPrintf</span><span class="p">(</span><span class="n">PETSC_COMM_WORLD</span><span class="p">,</span><span class="w"> </span><span class="s">" Number of requested eigenvalues: %D</span><span class="se">\n</span><span class="s">"</span><span class="p">,</span><span class="w"> </span><span class="n">nev</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">CHKERRQ</span><span class="p">(</span><span class="n">ierr</span><span class="p">);</span><span class="w"></span>

<span class="w">    </span><span class="n">PetscReal</span><span class="w"> </span><span class="n">tol</span><span class="p">;</span><span class="w"></span>
<span class="w">    </span><span class="n">PetscInt</span><span class="w"> </span><span class="n">maxit</span><span class="p">;</span><span class="w"></span>
<span class="w">    </span><span class="n">ierr</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">EPSGetTolerances</span><span class="p">(</span><span class="n">eps</span><span class="p">,</span><span class="w"> </span><span class="o">&amp;</span><span class="n">tol</span><span class="p">,</span><span class="w"> </span><span class="o">&amp;</span><span class="n">maxit</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">CHKERRQ</span><span class="p">(</span><span class="n">ierr</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">ierr</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">PetscPrintf</span><span class="p">(</span><span class="n">PETSC_COMM_WORLD</span><span class="p">,</span><span class="w"> </span><span class="s">" Stopping condition: tol=%.4g, maxit=%D</span><span class="se">\n</span><span class="s">"</span><span class="p">,</span><span class="w"> </span><span class="p">(</span><span class="kt">double</span><span class="p">)</span><span class="n">tol</span><span class="p">,</span><span class="w"> </span><span class="n">maxit</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">CHKERRQ</span><span class="p">(</span><span class="n">ierr</span><span class="p">);</span><span class="w"></span>

<span class="w">    </span><span class="cm">/* Display solution and clean up */</span><span class="w"></span>
<span class="w">    </span><span class="cm">/* Get number of converged approximate eigenpairs */</span><span class="w"></span>
<span class="w">    </span><span class="n">PetscInt</span><span class="w"> </span><span class="n">nconv</span><span class="p">;</span><span class="w"></span>
<span class="w">    </span><span class="n">ierr</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">EPSGetConverged</span><span class="p">(</span><span class="n">eps</span><span class="p">,</span><span class="w"> </span><span class="o">&amp;</span><span class="n">nconv</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">CHKERRQ</span><span class="p">(</span><span class="n">ierr</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">ierr</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">PetscPrintf</span><span class="p">(</span><span class="n">PETSC_COMM_WORLD</span><span class="p">,</span><span class="w"> </span><span class="s">" Number of converged eigenpairs: %D</span><span class="se">\n\n</span><span class="s">"</span><span class="p">,</span><span class="w"> </span><span class="n">nconv</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">CHKERRQ</span><span class="p">(</span><span class="n">ierr</span><span class="p">);</span><span class="w"></span>

<span class="w">    </span><span class="k">if</span><span class="w"> </span><span class="p">(</span><span class="n">nconv</span><span class="w"> </span><span class="o">&gt;</span><span class="w"> </span><span class="mi">0</span><span class="p">)</span><span class="w"> </span><span class="p">{</span><span class="w"></span>
<span class="w">    </span><span class="cm">/* Display eigenvalues and relative errors */</span><span class="w"></span>
<span class="w">    </span><span class="n">ierr</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">PetscPrintf</span><span class="p">(</span><span class="n">PETSC_COMM_WORLD</span><span class="p">,</span><span class="w"></span>
<span class="w">			</span><span class="s">"           k          ||Ax-kx||/||kx||</span><span class="se">\n</span><span class="s">"</span><span class="w"></span>
<span class="w">			</span><span class="s">"   ----------------- ------------------</span><span class="se">\n</span><span class="s">"</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">CHKERRQ</span><span class="p">(</span><span class="n">ierr</span><span class="p">);</span><span class="w"></span>

<span class="w">    </span><span class="k">for</span><span class="w"> </span><span class="p">(</span><span class="n">i</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="mi">0</span><span class="p">;</span><span class="w"> </span><span class="n">i</span><span class="w"> </span><span class="o">&lt;</span><span class="w"> </span><span class="n">nconv</span><span class="p">;</span><span class="w"> </span><span class="n">i</span><span class="o">++</span><span class="p">)</span><span class="w"> </span><span class="p">{</span><span class="w"></span>
<span class="w">	</span><span class="cm">/* Get converged eigenpairs: i-th eigenvalue is stored in kr (real part) and ki (imaginary part) */</span><span class="w"></span>
<span class="w">	</span><span class="n">PetscScalar</span><span class="w"> </span><span class="n">kr</span><span class="p">,</span><span class="w"> </span><span class="n">ki</span><span class="p">;</span><span class="w"></span>
<span class="w">	</span><span class="n">Vec</span><span class="w"> </span><span class="n">xr</span><span class="p">,</span><span class="w"> </span><span class="n">xi</span><span class="p">;</span><span class="w"></span>
<span class="w">	</span><span class="n">ierr</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">MatCreateVecs</span><span class="p">(</span><span class="n">A</span><span class="p">,</span><span class="w"> </span><span class="nb">NULL</span><span class="p">,</span><span class="w"> </span><span class="o">&amp;</span><span class="n">xr</span><span class="p">);</span><span class="w"></span>
<span class="w">	</span><span class="n">CHKERRQ</span><span class="p">(</span><span class="n">ierr</span><span class="p">);</span><span class="w"></span>
<span class="w">	</span><span class="n">ierr</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">MatCreateVecs</span><span class="p">(</span><span class="n">A</span><span class="p">,</span><span class="w"> </span><span class="nb">NULL</span><span class="p">,</span><span class="w"> </span><span class="o">&amp;</span><span class="n">xi</span><span class="p">);</span><span class="w"></span>
<span class="w">	</span><span class="n">CHKERRQ</span><span class="p">(</span><span class="n">ierr</span><span class="p">);</span><span class="w"></span>
<span class="w">	</span><span class="n">ierr</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">EPSGetEigenpair</span><span class="p">(</span><span class="n">eps</span><span class="p">,</span><span class="w"> </span><span class="n">i</span><span class="p">,</span><span class="w"> </span><span class="o">&amp;</span><span class="n">kr</span><span class="p">,</span><span class="w"> </span><span class="o">&amp;</span><span class="n">ki</span><span class="p">,</span><span class="w"> </span><span class="n">xr</span><span class="p">,</span><span class="w"> </span><span class="n">xi</span><span class="p">);</span><span class="w"></span>
<span class="w">	</span><span class="n">CHKERRQ</span><span class="p">(</span><span class="n">ierr</span><span class="p">);</span><span class="w"></span>

<span class="w">	</span><span class="cm">/* Compute the relative error associated to each eigenpair */</span><span class="w"></span>
<span class="w">	</span><span class="n">PetscReal</span><span class="w"> </span><span class="n">error</span><span class="p">;</span><span class="w"></span>
<span class="w">	</span><span class="n">ierr</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">EPSComputeError</span><span class="p">(</span><span class="n">eps</span><span class="p">,</span><span class="w"> </span><span class="n">i</span><span class="p">,</span><span class="w"> </span><span class="n">EPS_ERROR_RELATIVE</span><span class="p">,</span><span class="w"> </span><span class="o">&amp;</span><span class="n">error</span><span class="p">);</span><span class="w"></span>
<span class="w">	</span><span class="n">CHKERRQ</span><span class="p">(</span><span class="n">ierr</span><span class="p">);</span><span class="w"></span>

<span class="w">	</span><span class="n">PetscReal</span><span class="w"> </span><span class="n">re</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">PetscRealPart</span><span class="p">(</span><span class="n">kr</span><span class="p">);</span><span class="w"></span>
<span class="w">	</span><span class="n">PetscReal</span><span class="w"> </span><span class="n">im</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">PetscImaginaryPart</span><span class="p">(</span><span class="n">kr</span><span class="p">);</span><span class="w"></span>
<span class="w">	</span><span class="k">if</span><span class="w"> </span><span class="p">(</span><span class="n">im</span><span class="w"> </span><span class="o">!=</span><span class="w"> </span><span class="mf">0.0</span><span class="p">)</span><span class="w"> </span><span class="p">{</span><span class="w"></span>
<span class="w">	    </span><span class="n">ierr</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">PetscPrintf</span><span class="p">(</span><span class="n">PETSC_COMM_WORLD</span><span class="p">,</span><span class="w"> </span><span class="s">" %9f%+9fi %12g</span><span class="se">\n</span><span class="s">"</span><span class="p">,</span><span class="w"> </span><span class="p">(</span><span class="kt">double</span><span class="p">)</span><span class="n">re</span><span class="p">,</span><span class="w"> </span><span class="p">(</span><span class="kt">double</span><span class="p">)</span><span class="n">im</span><span class="p">,</span><span class="w"> </span><span class="p">(</span><span class="kt">double</span><span class="p">)</span><span class="n">error</span><span class="p">);</span><span class="w"></span>
<span class="w">	    </span><span class="n">CHKERRQ</span><span class="p">(</span><span class="n">ierr</span><span class="p">);</span><span class="w"></span>
<span class="w">	</span><span class="p">}</span><span class="w"> </span><span class="k">else</span><span class="w"> </span><span class="p">{</span><span class="w"></span>
<span class="w">	    </span><span class="n">ierr</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">PetscPrintf</span><span class="p">(</span><span class="n">PETSC_COMM_WORLD</span><span class="p">,</span><span class="w"> </span><span class="s">"   %12f       %12g</span><span class="se">\n</span><span class="s">"</span><span class="p">,</span><span class="w"> </span><span class="p">(</span><span class="kt">double</span><span class="p">)</span><span class="n">re</span><span class="p">,</span><span class="w"> </span><span class="p">(</span><span class="kt">double</span><span class="p">)</span><span class="n">error</span><span class="p">);</span><span class="w"></span>
<span class="w">	    </span><span class="n">CHKERRQ</span><span class="p">(</span><span class="n">ierr</span><span class="p">);</span><span class="w"></span>
<span class="w">	</span><span class="p">}</span><span class="w"></span>
<span class="w">    </span><span class="p">}</span><span class="w"></span>
<span class="w">    </span><span class="n">ierr</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">PetscPrintf</span><span class="p">(</span><span class="n">PETSC_COMM_WORLD</span><span class="p">,</span><span class="w"> </span><span class="s">"</span><span class="se">\n</span><span class="s">"</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">CHKERRQ</span><span class="p">(</span><span class="n">ierr</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="p">}</span><span class="w"></span>


<span class="w">    </span><span class="cm">/* Free work space */</span><span class="w"></span>

<span class="w">    </span><span class="n">ierr</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">EPSDestroy</span><span class="p">(</span><span class="o">&amp;</span><span class="n">eps</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">CHKERRQ</span><span class="p">(</span><span class="n">ierr</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">ierr</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">MatDestroy</span><span class="p">(</span><span class="o">&amp;</span><span class="n">A</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">CHKERRQ</span><span class="p">(</span><span class="n">ierr</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">ierr</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">VecDestroy</span><span class="p">(</span><span class="o">&amp;</span><span class="n">xr</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">CHKERRQ</span><span class="p">(</span><span class="n">ierr</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">ierr</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">VecDestroy</span><span class="p">(</span><span class="o">&amp;</span><span class="n">xi</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">CHKERRQ</span><span class="p">(</span><span class="n">ierr</span><span class="p">);</span><span class="w"></span>
</pre></div>
</div>
</div>
