output/posts/slepc/index.org
*** 求解器配置

**** 问题类型

     问题类型使用 ~EPSSetProblemType(EPS eps,EPSProblemType type);~ 进行设置

     可选的有
     | 问题类型                            | EPSProblemTyle | 命令行选项                 |
     |-------------------------------------+----------------+----------------------------|
     | Hermitian                           | EPS_HEP        | -eps_hermitian             |
     | Non-Hermitian                       | EPS_NHEP       | -eps_non_hermitian         |
     | Generalized Hermitian               | EPS_GHEP       | -eps_gen_hermitian         |
     | Generalized Hermitian indefinite    | EPS_GHIEP      | -eps_gen_indefinite        |
     | Generalized Non-Hermitian           | EPS_GNHEP      | -eps_gen_non_hermitian     |
     | GNHEP with positive (semi-)definite | BEPS_PGNHEP    | -eps_pos_gen_non_hermitian |

     还可以用一系列函数来判断设置的问题类型

     1. EPSIsGeneralized(EPS eps,PetscBool *gen);
     2. EPSIsHermitian(EPS eps,PetscBool *her);
     3. EPSIsPositive(EPS eps,PetscBool *pos);

**** 求解本征值个数
     使用 ~EPSSetDimensions(EPS eps,PetscInt nev,PetscInt ncv,PetscInt mpd);~ 设置要求的本征值个数
     1. ~PetscInt nev~ 本征值个数
     2. ~PetscInt ncv~ 最大工作空间的维数，指的是用多少个中间向量, ~ncv~ 至少和 ~nev~ 一样多，最好是它的两倍以上
     3. ~PetscInt mpd~ 最大投影空间维数，用来计算很多本征值个数的时候，设置它可以减少工作空间的需求

**** 求解本征值位置
     1. ~EPSSetWhichEigenpairs(EPS eps,EPSWhich which);~ 设置要求本征值的位置
     2. ~EPSSetTarget(EPS eps,PetscScalar target);~ 设置计算距离某个值最近的本征值
     3. ~EPSSetInterval(EPS eps,PetscScalar a,PetscScalar b);~ 计算 $\lambda \in [a, b]$ 的所有本征值
     4. ~EPSSetTwoSided(EPS eps,PetscBool twosided);~ 计算非厄米问题的左本征矢

     可选的本征值位置有
     | EPSWhich               | 命令行                  | 说明                      |
     |------------------------+-------------------------+---------------------------|
     | EPS_LARGEST_MAGNITUDE  | -eps_largest_magnitude  | 最大 $\vert \lambda\vert$              |
     | EPS_SMALLEST_MAGNITUDE | -eps_smallest_magnitude | 最小 $\vert\lambda\vert$                |
     | EPS_LARGEST_REAL       | -eps_largest_real       | 最大 $\mathrm{Re}(\lambda)$     |
     | EPS_SMALLEST_REAL      | -eps_smallest_real      | 最小 $\mathrm{Re}(\lambda)$     |
     | EPS_LARGEST_IMAGINARY  | -eps_largest_imaginary  | 最大 $\mathrm{Im}(\lambda)$     |
     | EPS_SMALLEST_IMAGINARY | -eps_smallest_imaginary | 最小 $\mathrm{Im}(\lambda)$     |
     | EPS_TARGET_MAGNITUDE   | -eps_target_magnitude   | 最小 $\vert\lambda - \tau\vert$            |
     | EPS_TARGET_REAL        | -eps_target_real        | 最小 $\vert\mathrm{Re}(\lambda-\tau)\vert$ |
     | EPS_TARGET_IMAGINARY   | -eps_target_imaginary   | 最小 $\vert\mathrm{Im}(\lambda-\tau)\vert$ |
     | EPS_ALL                | -eps_all                | 所有 $\lambda \in [a,b]$          |
     | EPS_WHICH_USER         |                         | 用户定义                  |

**** 选择算法
     通过 ~EPSSetType(EPS eps,EPSType method);~ 设置求解器使用的算法
     

     SLEPc 支持的算法有
     - 基本算法
       - Power Itration, Rayleigh Quotient iteration(RQI)
       - Subspace Iteration with Rayleigh-Ritz projection and locking
       - Arnoldi method with explicit restart and deflation
       - Lanczos with explicit restart
     - Krylov-Schur, thick-restart Lanczos method (默认)
     - Generalized Davidson
     - Jacobi-Davidson
     - RQCG
     - LOBPCG
     - CISS
     - Lyapunov inverse iteration

     注意：
     1. 由于实现支持有限，只有 ~arnoldi~, ~krylov-schur~, ~gd~, ~jd~, ~arpack~ 支持所有类型的问题求解

        | 方法                       | EPSType        | 选项名      |
        |----------------------------+----------------+-------------|
        | Power / Inverse / RQI      | EPSPOWER       | power       |
        | Subspace Iteration         | EPSSUBSPACE    | subspace    |
        | Arnoldi                    | EPSARNOLDI     | arnoldi     |
        | Lanczos                    | EPSLANCZOS     | lanczos     |
        | Krylov-Schur               | EPSKRYLOVSCHUR | krylovschur |
        | Generalized Davidson       | EPSGD          | gd          |
        | Jacobi-Davidson            | EPSJD          | jd          |
        | Rayleigh quotient CG       | EPSRQCG        | rqcg        |
        | LOBPCG                     | EPSLOBPCG      | lobpcg      |
        | Contour integral SS        | EPSCISS        | ciss        |
        | Lyapunov Inverse Iteration | EPSLYAPII      | lyapii      |
        |----------------------------+----------------+-------------|
        | LAPACK solver              | EPSLAPACK      | lapack      |
        | Wrapper to arpack          | EPSARPACK      | arpack      |
        | Wrapper to primme          | EPSPRIMME      | primme      |
        | Wrapper to evsl            | EPSEVSL        | evsl        |
        | Wrapper to trlan           | EPSTRLAN       | trlan       |
        | Wrapper to blopex          | EPSBLOPEX      | blopex      |
        | Wrapper to scalapack       | EPSSCALAPACK   | scalapack   |
        | Wrapper to elpa            | EPSELPA        | elpa        |
        | Wrapper to elemental       | EPSELEMENTAL   | elemental   |
        | Wrapper to feast           | EPSFEAST       | feast       |

