posts/slepc/index.html

<div id="outline-container-org72f3e39" class="outline-4">
<h4 id="org72f3e39">求解器配置</h4>
<div class="outline-text-4" id="text-org72f3e39">
</div>
<ul class="org-ul">
<li>
<a id="orga23caaf"></a>问题类型<br><div class="outline-text-5" id="text-orga23caaf">
<p>
问题类型使用 <code>EPSSetProblemType(EPS eps,EPSProblemType type);</code> 进行设置
</p>

<p>
可选的有
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="org-left">
<col class="org-left">
<col class="org-left">
</colgroup>
<thead><tr>
<th scope="col" class="org-left">问题类型</th>
<th scope="col" class="org-left">EPSProblemTyle</th>
<th scope="col" class="org-left">命令行选项</th>
</tr></thead>
<tbody>
<tr>
<td class="org-left">Hermitian</td>
<td class="org-left">EPS<sub>HEP</sub>
</td>
<td class="org-left">-eps<sub>hermitian</sub>
</td>
</tr>
<tr>
<td class="org-left">Non-Hermitian</td>
<td class="org-left">EPS<sub>NHEP</sub>
</td>
<td class="org-left">-eps<sub>non</sub><sub>hermitian</sub>
</td>
</tr>
<tr>
<td class="org-left">Generalized Hermitian</td>
<td class="org-left">EPS<sub>GHEP</sub>
</td>
<td class="org-left">-eps<sub>gen</sub><sub>hermitian</sub>
</td>
</tr>
<tr>
<td class="org-left">Generalized Hermitian indefinite</td>
<td class="org-left">EPS<sub>GHIEP</sub>
</td>
<td class="org-left">-eps<sub>gen</sub><sub>indefinite</sub>
</td>
</tr>
<tr>
<td class="org-left">Generalized Non-Hermitian</td>
<td class="org-left">EPS<sub>GNHEP</sub>
</td>
<td class="org-left">-eps<sub>gen</sub><sub>non</sub><sub>hermitian</sub>
</td>
</tr>
<tr>
<td class="org-left">GNHEP with positive (semi-)definite</td>
<td class="org-left">BEPS<sub>PGNHEP</sub>
</td>
<td class="org-left">-eps<sub>pos</sub><sub>gen</sub><sub>non</sub><sub>hermitian</sub>
</td>
</tr>
</tbody>
</table>
<p>
还可以用一系列函数来判断设置的问题类型
</p>

<ol class="org-ol">
<li>EPSIsGeneralized(EPS eps,PetscBool *gen);</li>
<li>EPSIsHermitian(EPS eps,PetscBool *her);</li>
<li>EPSIsPositive(EPS eps,PetscBool *pos);</li>
</ol>
</div>
</li>

<li>
<a id="orgb80ca6b"></a>求解本征值个数<br><div class="outline-text-5" id="text-orgb80ca6b">
<p>
使用 <code>EPSSetDimensions(EPS eps,PetscInt nev,PetscInt ncv,PetscInt mpd);</code> 设置要求的本征值个数
</p>
<ol class="org-ol">
<li>
<code>PetscInt nev</code> 本征值个数</li>
<li>
<code>PetscInt ncv</code> 最大工作空间的维数，指的是用多少个中间向量, <code>ncv</code> 至少和 <code>nev</code> 一样多，最好是它的两倍以上</li>
<li>
<code>PetscInt mpd</code> 最大投影空间维数，用来计算很多本征值个数的时候，设置它可以减少工作空间的需求</li>
</ol>
</div>
</li>

<li>
<a id="org357a7cb"></a>求解本征值位置<br><div class="outline-text-5" id="text-org357a7cb">
<ol class="org-ol">
<li>
<code>EPSSetWhichEigenpairs(EPS eps,EPSWhich which);</code> 设置要求本征值的位置</li>
<li>
<code>EPSSetTarget(EPS eps,PetscScalar target);</code> 设置计算距离某个值最近的本征值</li>
<li>
<code>EPSSetInterval(EPS eps,PetscScalar a,PetscScalar b);</code> 计算 \(\lambda \in [a, b]\) 的所有本征值</li>
<li>
<code>EPSSetTwoSided(EPS eps,PetscBool twosided);</code> 计算非厄米问题的左本征矢</li>
</ol>
<p>
可选的本征值位置有
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="org-left">
<col class="org-left">
<col class="org-left">
</colgroup>
<thead><tr>
<th scope="col" class="org-left">EPSWhich</th>
<th scope="col" class="org-left">命令行</th>
<th scope="col" class="org-left">说明</th>
</tr></thead>
<tbody>
<tr>
<td class="org-left">EPS<sub>LARGEST</sub><sub>MAGNITUDE</sub>
</td>
<td class="org-left">-eps<sub>largest</sub><sub>magnitude</sub>
</td>
<td class="org-left">最大 \(\vert \lambda\vert\)</td>
</tr>
<tr>
<td class="org-left">EPS<sub>SMALLEST</sub><sub>MAGNITUDE</sub>
</td>
<td class="org-left">-eps<sub>smallest</sub><sub>magnitude</sub>
</td>
<td class="org-left">最小 \(\vert\lambda\vert\)</td>
</tr>
<tr>
<td class="org-left">EPS<sub>LARGEST</sub><sub>REAL</sub>
</td>
<td class="org-left">-eps<sub>largest</sub><sub>real</sub>
</td>
<td class="org-left">最大 \(\mathrm{Re}(\lambda)\)</td>
</tr>
<tr>
<td class="org-left">EPS<sub>SMALLEST</sub><sub>REAL</sub>
</td>
<td class="org-left">-eps<sub>smallest</sub><sub>real</sub>
</td>
<td class="org-left">最小 \(\mathrm{Re}(\lambda)\)</td>
</tr>
<tr>
<td class="org-left">EPS<sub>LARGEST</sub><sub>IMAGINARY</sub>
</td>
<td class="org-left">-eps<sub>largest</sub><sub>imaginary</sub>
</td>
<td class="org-left">最大 \(\mathrm{Im}(\lambda)\)</td>
</tr>
<tr>
<td class="org-left">EPS<sub>SMALLEST</sub><sub>IMAGINARY</sub>
</td>
<td class="org-left">-eps<sub>smallest</sub><sub>imaginary</sub>
</td>
<td class="org-left">最小 \(\mathrm{Im}(\lambda)\)</td>
</tr>
<tr>
<td class="org-left">EPS<sub>TARGET</sub><sub>MAGNITUDE</sub>
</td>
<td class="org-left">-eps<sub>target</sub><sub>magnitude</sub>
</td>
<td class="org-left">最小 \(\vert\lambda - \tau\vert\)</td>
</tr>
<tr>
<td class="org-left">EPS<sub>TARGET</sub><sub>REAL</sub>
</td>
<td class="org-left">-eps<sub>target</sub><sub>real</sub>
</td>
<td class="org-left">最小 \(\vert\mathrm{Re}(\lambda-\tau)\vert\)</td>
</tr>
<tr>
<td class="org-left">EPS<sub>TARGET</sub><sub>IMAGINARY</sub>
</td>
<td class="org-left">-eps<sub>target</sub><sub>imaginary</sub>
</td>
<td class="org-left">最小 \(\vert\mathrm{Im}(\lambda-\tau)\vert\)</td>
</tr>
<tr>
<td class="org-left">EPS<sub>ALL</sub>
</td>
<td class="org-left">-eps<sub>all</sub>
</td>
<td class="org-left">所有 \(\lambda \in [a,b]\)</td>
</tr>
<tr>
<td class="org-left">EPS<sub>WHICH</sub><sub>USER</sub>
</td>
<td class="org-left"> </td>
<td class="org-left">用户定义</td>
</tr>
</tbody>
</table>
</div>
</li>

<li>
<a id="orgcfc6778"></a>选择算法<br><div class="outline-text-5" id="text-orgcfc6778">
<p>
通过 <code>EPSSetType(EPS eps,EPSType method);</code> 设置求解器使用的算法
</p>


<p>
SLEPc 支持的算法有
</p>
<ul class="org-ul">
<li>基本算法
<ul class="org-ul">
<li>Power Itration, Rayleigh Quotient iteration(RQI)</li>
<li>Subspace Iteration with Rayleigh-Ritz projection and locking</li>
<li>Arnoldi method with explicit restart and deflation</li>
<li>Lanczos with explicit restart</li>
</ul>
</li>
<li>Krylov-Schur, thick-restart Lanczos method (默认)</li>
<li>Generalized Davidson</li>
<li>Jacobi-Davidson</li>
<li>RQCG</li>
<li>LOBPCG</li>
<li>CISS</li>
<li>Lyapunov inverse iteration</li>
</ul>
<p>
注意：
</p>
<ol class="org-ol">
<li>
<p>
由于实现支持有限，只有 <code>arnoldi</code>, <code>krylov-schur</code>, <code>gd</code>, <code>jd</code>, <code>arpack</code> 支持所有类型的问题求解
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="org-left">
<col class="org-left">
<col class="org-left">
</colgroup>
<thead><tr>
<th scope="col" class="org-left">方法</th>
<th scope="col" class="org-left">EPSType</th>
<th scope="col" class="org-left">选项名</th>
</tr></thead>
<tbody>
<tr>
<td class="org-left">Power / Inverse / RQI</td>
<td class="org-left">EPSPOWER</td>
<td class="org-left">power</td>
</tr>
<tr>
<td class="org-left">Subspace Iteration</td>
<td class="org-left">EPSSUBSPACE</td>
<td class="org-left">subspace</td>
</tr>
<tr>
<td class="org-left">Arnoldi</td>
<td class="org-left">EPSARNOLDI</td>
<td class="org-left">arnoldi</td>
</tr>
<tr>
<td class="org-left">Lanczos</td>
<td class="org-left">EPSLANCZOS</td>
<td class="org-left">lanczos</td>
</tr>
<tr>
<td class="org-left">Krylov-Schur</td>
<td class="org-left">EPSKRYLOVSCHUR</td>
<td class="org-left">krylovschur</td>
</tr>
<tr>
<td class="org-left">Generalized Davidson</td>
<td class="org-left">EPSGD</td>
<td class="org-left">gd</td>
</tr>
<tr>
<td class="org-left">Jacobi-Davidson</td>
<td class="org-left">EPSJD</td>
<td class="org-left">jd</td>
</tr>
<tr>
<td class="org-left">Rayleigh quotient CG</td>
<td class="org-left">EPSRQCG</td>
<td class="org-left">rqcg</td>
</tr>
<tr>
<td class="org-left">LOBPCG</td>
<td class="org-left">EPSLOBPCG</td>
<td class="org-left">lobpcg</td>
</tr>
<tr>
<td class="org-left">Contour integral SS</td>
<td class="org-left">EPSCISS</td>
<td class="org-left">ciss</td>
</tr>
<tr>
<td class="org-left">Lyapunov Inverse Iteration</td>
<td class="org-left">EPSLYAPII</td>
<td class="org-left">lyapii</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">LAPACK solver</td>
<td class="org-left">EPSLAPACK</td>
<td class="org-left">lapack</td>
</tr>
<tr>
<td class="org-left">Wrapper to arpack</td>
<td class="org-left">EPSARPACK</td>
<td class="org-left">arpack</td>
</tr>
<tr>
<td class="org-left">Wrapper to primme</td>
<td class="org-left">EPSPRIMME</td>
<td class="org-left">primme</td>
</tr>
<tr>
<td class="org-left">Wrapper to evsl</td>
<td class="org-left">EPSEVSL</td>
<td class="org-left">evsl</td>
</tr>
<tr>
<td class="org-left">Wrapper to trlan</td>
<td class="org-left">EPSTRLAN</td>
<td class="org-left">trlan</td>
</tr>
<tr>
<td class="org-left">Wrapper to blopex</td>
<td class="org-left">EPSBLOPEX</td>
<td class="org-left">blopex</td>
</tr>
<tr>
<td class="org-left">Wrapper to scalapack</td>
<td class="org-left">EPSSCALAPACK</td>
<td class="org-left">scalapack</td>
</tr>
<tr>
<td class="org-left">Wrapper to elpa</td>
<td class="org-left">EPSELPA</td>
<td class="org-left">elpa</td>
</tr>
<tr>
<td class="org-left">Wrapper to elemental</td>
<td class="org-left">EPSELEMENTAL</td>
<td class="org-left">elemental</td>
</tr>
<tr>
<td class="org-left">Wrapper to feast</td>
<td class="org-left">EPSFEAST</td>
<td class="org-left">feast</td>
</tr>
</tbody>
</table>
</li>
</ol>
</div>
</li>

<li>
<a id="org13db2c1"></a>获得结果<br><div class="outline-text-5" id="text-org13db2c1">
<ol class="org-ol">
<li>
